src/cf/InformationRegisters/вогИсполнителиРолейИДелегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогИсполнителиРолейИДелегаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсполнительДелегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаДелегирования</Name>
					<Comment>Настройку делегирования, по которой была сделана запись в регистре.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.вогДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбластиДелегирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/вогФормаСпискаЗадачПредмета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет") И ЗначениеЗаполнено(Параметры.Предмет) Тогда
		ЗаполнитьТаблицуЗадач(Параметры.Предмет);	
	Иначе
		Сообщить("Не указан предмет. Форма будет закрыта");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗадач(Предмет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогИсполнителиРолейИДелегаты.РольПользователь КАК РольПользователь
		|ПОМЕСТИТЬ вт_Делегирование
		|ИЗ
		|	РегистрСведений.вогИсполнителиРолейИДелегаты КАК вогИсполнителиРолейИДелегаты
		|ГДЕ
		|	вогИсполнителиРолейИДелегаты.ИсполнительДелегат = &Исполнитель
		|	И вогИсполнителиРолейИДелегаты.ИмяОбластиДелегирования В ("""", ""ПроцессыИЗадачи"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.Ссылка КАК Задача,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.Наименование КАК Наименование,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.Дата КАК ДатаЗадачи,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс КАК БизнесПроцесс,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.Выполнена КАК Выполнена,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Номер КАК Номер,
		|	ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.КартаМаршрута) КАК КартаМаршрута
		|ИЗ
		// ++ VOG Солодов В.В. 24.06.2021 DEV-249
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителяЗадачиПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.CRM_БизнесПроцесс КАК ТаблицаПроцессы
		|		ПО ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс = ТаблицаПроцессы.Ссылка
		|ГДЕ
		|	ТаблицаПроцессы.Предмет = &Предмет
		// До изменения
		//|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю(
		//|			,
		//|			(Исполнитель = &Исполнитель
		//|				ИЛИ РольИсполнителя В (&РолиПользователя)
		//|				ИЛИ Исполнитель В
		//|					(ВЫБРАТЬ
		//|						вт_Делегирование.РольПользователь КАК РольПользователь
		//|					ИЗ
		//|						вт_Делегирование КАК вт_Делегирование))
		//|				И БизнесПроцесс.Предмет = &Предмет) КАК ЗадачаИсполнителяЗадачиПоИсполнителю
		//|ГДЕ
		//|	ЗадачаИсполнителяЗадачиПоИсполнителю.БизнесПроцесс.Предмет = &Предмет
		// -- VOG Солодов В.В. 24.06.2021 DEV-249
		|	И (ЗадачаИсполнителяЗадачиПоИсполнителю.Исполнитель = &Исполнитель
		|			ИЛИ ЗадачаИсполнителяЗадачиПоИсполнителю.РольИсполнителя В (&РолиПользователя)
		|			ИЛИ ЗадачаИсполнителяЗадачиПоИсполнителю.Исполнитель В
		|				(ВЫБРАТЬ
		|					вт_Делегирование.РольПользователь КАК РольПользователь
		|				ИЗ
		|					вт_Делегирование КАК вт_Делегирование))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗадачи УБЫВ
		|ИТОГИ ПО
		|	БизнесПроцесс";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("РолиПользователя", РолиПользователя);
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаБизнесПроцесс = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаБизнесПроцесс.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаБизнесПроцесс.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			НоваяСтрока = СписокЗадач.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗадачу(Команда)
	
	ТекущаяСтрока = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	Иначе
		ОткрытьЗадачу(ТекущаяСтрока.Задача);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗадачу(СписокЗадач[ВыбраннаяСтрока].Задача);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу(ВыбраннаяЗадача)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",ВыбраннаяЗадача);
	ПараметрыФормы.Вставить("НеОткрыватьПредмет",Истина);
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачиНезависимыйПроцесс",
				ПараметрыФормы,
				ЭтаФорма,
				,
				,
				, Новый ОписаниеОповещения("ОткрытьЗадачуЗавершение", ЭтотОбъект),  
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
